In [234]:
import pandas as pd
from sqlalchemy import create_engine

In [235]:
! docker stop test_types_postgres
! docker rm test_types_postgres
! docker run -p 19191:5432 --name test_types_postgres -e POSTGRES_PASSWORD=password -d postgres

test_types_postgres
test_types_postgres
160ae2e7d0c8005834fed1ef3ed13f81614518091b0284f026ea01867ab6fde8

In [284]:
engine = create_engine('postgresql://postgres:password@localhost:19191/postgres')
engine.execute('DROP TABLE IF EXISTS test_types')
engine.execute("""
CREATE TABLE test_types (
    strings varchar(123),
    ints integer,
    floats float,
    decimals numeric,
    bools boolean,
    dates date,
    time time,
    datetimes timestamp,
    uuids uuid
);
""")
engine.execute("""
INSERT INTO test_types VALUES
    ('string', 123, 1.2, 1.2, true, '1985-02-10', '04:05', '2004-10-19 10:23:54', '0e37df36-f698-11e6-8dd4-cb9ced3df976'),
    ('', 0, 0, 0, false, '2004-05-07', '040506', '2004-10-19 10:23:54', '0e37df36-f698-11e6-8dd4-cb9ced3df975'),
    (null, null, null, null, null, null, null, null, null);
""")
r = engine.execute("""
SELECT * FROM test_types;
""")
rows = r.fetchall()
#df_users = pd.DataFrame({"id": [1, 2, 3], "name": ["Adam", "Jeff", "John"]})
#df_users.to_sql('users', con=engine, index=False, if_exists="append")
#engine.execute('ALTER TABLE users ADD PRIMARY KEY (id);')

In [285]:
#rows = [["string", 1, 2.0, Decimal(2.0), True], ["", 0, 0, Decimal(0), False], [None, None, None, None, None]]
[type(value) for value in rows[0]]

[str,
 int,
 float,
 decimal.Decimal,
 bool,
 datetime.date,
 datetime.time,
 datetime.datetime,
 uuid.UUID]

In [306]:
columns = ["strings", "ints", "floats", "decimals", "bools", "dates", "times", "datetimes", "uuids"]

In [307]:
df = pd.DataFrame(rows, columns=columns)

In [308]:
df.dtypes

strings              object
ints                float64
floats              float64
decimals             object
bools                object
dates                object
times                object
datetimes    datetime64[ns]
uuids                object
dtype: object

In [309]:
df

,strings,ints,floats,decimals,bools,dates,times,datetimes,uuids
0,string,123.0,1.2,1.2,True,1985-02-10,04:05:00,2004-10-19 10:23:54,0e37df36-f698-11e6-8dd4-cb9ced3df976
1,,0.0,0.0,0,False,2004-05-07,04:05:06,2004-10-19 10:23:54,0e37df36-f698-11e6-8dd4-cb9ced3df975
2,None,NaN,NaN,None,None,None,None,NaT,None

In [310]:
df = pd.DataFrame(rows, dtype="object", columns=columns)

In [311]:
df.dtypes

strings      object
ints         object
floats       object
decimals     object
bools        object
dates        object
times        object
datetimes    object
uuids        object
dtype: object

In [312]:
df

,strings,ints,floats,decimals,bools,dates,times,datetimes,uuids
0,string,123,1.2,1.2,True,1985-02-10,04:05:00,2004-10-19 10:23:54,0e37df36-f698-11e6-8dd4-cb9ced3df976
1,,0,0.0,0,False,2004-05-07,04:05:06,2004-10-19 10:23:54,0e37df36-f698-11e6-8dd4-cb9ced3df975
2,None,None,None,None,None,None,None,None,None

In [325]:
#df = df.astype(str)
types = {
    "strings": "string",
    "ints": "Int64",
    "floats": "Float64",
    "decimals": "object",
    "bools": "boolean",
    "dates": "object",
    "times": "object",
    "datetimes": "datetime64[ns]",
    "uuids": "string"
}
df = df.astype(types)

In [326]:
df.dtypes

strings              string
ints                  Int64
floats              Float64
decimals             object
bools               boolean
dates                object
times                object
datetimes    datetime64[ns]
uuids                string
dtype: object

In [327]:
df

,strings,ints,floats,decimals,bools,dates,times,datetimes,uuids
0,string,123,1.2,1.2,True,1985-02-10,04:05:00,2004-10-19 10:23:54,0e37df36-f698-11e6-8dd4-cb9ced3df976
1,,0,0.0,0,False,2004-05-07,04:05:06,2004-10-19 10:23:54,0e37df36-f698-11e6-8dd4-cb9ced3df975
2,<NA>,<NA>,<NA>,None,<NA>,None,None,NaT,<NA>

In [328]:
df.to_parquet("output.parquet")

In [329]:
! parquet-tools schema output.parquet

WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by org.apache.hadoop.security.authentication.util.KerberosUtil (file:/usr/local/Cellar/parquet-tools/1.12.0/libexec/parquet-tools-deprecated-1.12.0.jar) to method sun.security.krb5.Config.getInstance()
WARNING: Please consider reporting this to the maintainers of org.apache.hadoop.security.authentication.util.KerberosUtil
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
message schema {
  optional binary strings (STRING);
  optional int64 ints;
  optional double floats;
  optional fixed_len_byte_array(1) decimals (DECIMAL(2,1));
  optional boolean bools;
  optional int32 dates (DATE);
  optional int64 times (TIME(MICROS,true));
  optional int64 datetimes (TIMESTAMP(MICROS,false));
  optional binary uuids (STRING);
}